EXAM1 REVIEW

In [1]:
import pandas as pd
df = pd.DataFrame({'Name': ['John', 'Bobby', 'Mina', 'Peter', 'Nicky'], 
      'Program': ['UG', 'Graduate', 'Graduate', 'UG', 'Graduate'], 
      'Age': [27, 23, 21, 23, 24]}) 
   
df

    Name   Program  Age
0   John        UG   27
1  Bobby  Graduate   23
2   Mina  Graduate   21
3  Peter        UG   23
4  Nicky  Graduate   24

In [ ]:
# Q1 How many rows and columns are in the following pivot table from the data frame df?
# A.	5 rows, 2 columns

df.pivot(columns=['Program'], index='Name', values='Age')

Program  Graduate    UG
Name
Bobby        23.0   NaN
John          NaN  27.0
Mina         21.0   NaN
Nicky        24.0   NaN
Peter         NaN  23.0

In [2]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [3]:
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
#Q2 How many rows and columns in the following data frame?
# A.	8 rows, 4 columns

pd.concat([df1, df2], ignore_index=True)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [4]:
df3 = pd.DataFrame({"name": ['Magneto', 'Storm', 'Mystique', 'Batman', 'Joker', 'Catwoman', 'Hellboy'],
                    'alignment': ['bad', 'good', 'bad', 'good', 'bad', 'bad', 'good'],
                    'gender': ['male', 'female', 'female', 'male', 'male', 'female', 'male'],
                    'publisher': ['Marvel', 'Marvel', 'Marvel', 'DC', 'DC', 'DC', 'Dark Horse Comics']})

df3

       name alignment  gender          publisher
0   Magneto       bad    male             Marvel
1     Storm      good  female             Marvel
2  Mystique       bad  female             Marvel
3    Batman      good    male                 DC
4     Joker       bad    male                 DC
5  Catwoman       bad  female                 DC
6   Hellboy      good    male  Dark Horse Comics

In [6]:
df4 = pd.DataFrame({'publish': ['DC', 'Marvel', 'Image'],
                    'year_founded': [1934, 1939, 1992]})
df4

  publish  year_founded
0      DC          1934
1  Marvel          1939
2   Image          1992

In [ ]:
# Question 3
# How many rows and columns are in the following data frame?
# B.	6 rows, 6 columns

pd.merge(left=df3, right=df4, left_on ="publisher", right_on = "publish", how="inner")

       name alignment  gender publisher publish  year_founded
0   Magneto       bad    male    Marvel  Marvel          1939
1     Storm      good  female    Marvel  Marvel          1939
2  Mystique       bad  female    Marvel  Marvel          1939
3    Batman      good    male        DC      DC          1934
4     Joker       bad    male        DC      DC          1934
5  Catwoman       bad  female        DC      DC          1934

In [ ]:
# Question 4
# Which code creates the data frame df5? 
# A


df5 = pd.merge(left=df3, right=df4, left_on="publisher", right_on="publish", how="right")
df5

       name alignment  gender publisher publish  year_founded
0    Batman      good    male        DC      DC          1934
1     Joker       bad    male        DC      DC          1934
2  Catwoman       bad  female        DC      DC          1934
3   Magneto       bad    male    Marvel  Marvel          1939
4     Storm      good  female    Marvel  Marvel          1939
5  Mystique       bad  female    Marvel  Marvel          1939
6       NaN       NaN     NaN       NaN   Image          1992

In [15]:
# Question 5
# Which code creates the data frame df6?
# B


df6= pd.merge(left=df3, right=df4, left_on="publisher", right_on="publish", how="outer")
df6

       name alignment  gender          publisher publish  year_founded
0    Batman      good    male                 DC      DC        1934.0
1     Joker       bad    male                 DC      DC        1934.0
2  Catwoman       bad  female                 DC      DC        1934.0
3   Hellboy      good    male  Dark Horse Comics     NaN           NaN
4       NaN       NaN     NaN                NaN   Image        1992.0
5   Magneto       bad    male             Marvel  Marvel        1939.0
6     Storm      good  female             Marvel  Marvel        1939.0
7  Mystique       bad  female             Marvel  Marvel        1939.0

In [ ]:
# Question 6
# Which code creates the data frame df7? 
# A

d7 = df3[['name','gender']][df3['gender']=='female']
d7

       name  gender
1     Storm  female
2  Mystique  female
5  Catwoman  female

In [ ]:
#Q7
# From df3 how many rows will result from the following data frame?
# B. 14 rows

df3.melt(value_vars=["name","alignment"])
# melt() converts wide format to long format.

     variable     value
0        name   Magneto
1        name     Storm
2        name  Mystique
3        name    Batman
4        name     Joker
5        name  Catwoman
6        name   Hellboy
7   alignment       bad
8   alignment      good
9   alignment       bad
10  alignment      good
11  alignment       bad
12  alignment       bad
13  alignment      good

In [19]:
# Question 8
# Which code returns the value B1 from df1?
# A 

df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

df1


#df1.loc[1, 'B']

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [20]:
# Question 9
# Which code groups by Program and finds the average of the values in Age of the data frame df, returning a one-column data frame?

df = pd.DataFrame({'Name': ['John', 'Bobby', 'Mina', 'Peter', 'Nicky'], 
      'Program': ['UG', 'Graduate', 'Graduate', 'UG', 'Graduate'], 
      'Age': [27, 23, 21, 23, 24]}) 
   
df 

df.groupby(by=['Program']).agg({"Age": "mean"})

                Age
Program
Graduate  22.666667
UG        25.000000

In [ ]:
# Q10
# How many rows are in the following data frame?
# 4
df = pd.DataFrame({'Name': ['John', 'Bobby', 'Mina', 'Peter', 'Nicky'], 
      'Program': ['UG', 'Graduate', 'Graduate', 'UG', 'Graduate'], 
      'Age': [27, 23, 21, 23, 24]}) 


df.drop_duplicates(subset=['Age'])

    Name   Program  Age
0   John        UG   27
1  Bobby  Graduate   23
2   Mina  Graduate   21
4  Nicky  Graduate   24

In [10]:
data1 = [
    {
        "name": "Alice",
        "age": 30,
        "address": {
            "street": "123 Main St",
            "city": "New York"
        },
        "hobbies": ["reading", "hiking"]
    },
    {
        "name": "Bob",
        "age": 25,
        "address": {
            "street": "456 Elm St",
            "city": "Los Angeles"
        },
        "hobbies": ["gaming", "cycling"]
    }
]

In [ ]:
# Q11
# How many rows and columns are in the following data frame? 
# A. 2 rows, 5 columns 

pd.json_normalize(data1)

    name  age            hobbies address.street address.city
0  Alice   30  [reading, hiking]    123 Main St     New York
1    Bob   25  [gaming, cycling]     456 Elm St  Los Angeles

In [ ]:
# Q 12
# How many rows and columns are in the following data frame? 

# record_path flattens the nested list of hobbies. Tells pandas to make each hobby its own row.
# meta specifies the other fields to include in each row.
# ['address', 'street'] and ['address', 'city'] tell Pandas to extract nested fields in the address dictionary.
# errors='ignore' means avoids errors if any of the entries donâ€™t contain one of those fields.

df = pd.json_normalize(data1, 
                       record_path='hobbies', 
                       meta=['name', 'age', ['address', 'street'], ['address', 'city']], 
                       errors='ignore')
df

         0   name age address.street address.city
0  reading  Alice  30    123 Main St     New York
1   hiking  Alice  30    123 Main St     New York
2   gaming    Bob  25     456 Elm St  Los Angeles
3  cycling    Bob  25     456 Elm St  Los Angeles

In [ ]:
# Q 13
# How many rows and columns are in the following data frame? 
# B.	2 rows, 1 column

data = next(item for item in data1 if item['name'] == 'Alice') # list comprehension to find the dictionary where name is Alice
data_df = pd.DataFrame(data['hobbies'], columns=['hobby']) # extract the hobbies list, name column hobby, and create a data frame
data_df

     hobby
0  reading
1   hiking

In [ ]:
# Q14 
# From the data frame df. What is the value of ?
df = pd.DataFrame({'Name': ['John', 'Bobby', 'Mina', 'Peter', 'Nicky'], 
      'Program': ['UG', 'Graduate', 'Graduate', 'UG', 'Graduate'], 
      'Age': [27, 23, 21, 23, 24]}) 

#filters the dataframe, keeping only the rows where the value in the 'Program' column is 'Graduate
#from filtered rows, selects the column 'Age'. 
#The result is a pandas Series containing only the ages of the 'Graduate' students
#.values[1] selects the age at index position 1

df[df['Program']=='Graduate']['Age'].values[1]
#.values[1]  # 21

1    23
2    21
4    24
Name: Age, dtype: int64

In [ ]:
#Q15
# You run this code and click the button 4 times. What is the value of n?
#The variable n will always reset to 0 every time the app reruns.
#1


import streamlit as st
n = 0
if st.button("Click me"):
    n = n + 1
    st.write(n)

2025-11-01 22:47:24.233 WARNING streamlit.runtime.scriptrunner_utils.script_run_context: Thread 'MainThread': missing ScriptRunContext! This warning can be ignored when running in bare mode.
2025-11-01 22:47:24.233 WARNING streamlit.runtime.scriptrunner_utils.script_run_context: Thread 'MainThread': missing ScriptRunContext! This warning can be ignored when running in bare mode.
2025-11-01 22:47:24.233 WARNING streamlit.runtime.scriptrunner_utils.script_run_context: Thread 'MainThread': missing ScriptRunContext! This warning can be ignored when running in bare mode.
2025-11-01 22:47:24.233 WARNING streamlit.runtime.scriptrunner_utils.script_run_context: Thread 'MainThread': missing ScriptRunContext! This warning can be ignored when running in bare mode.
2025-11-01 22:47:24.667
  Warning: to view this Streamlit app on a browser, run it with the following
  command:

    streamlit run C:\Users\13154\AppData\Roaming\Python\Python311\site-packages\ipykernel_launcher.py [ARGUMENTS]
2025-11-01 22:47:24.667 Thread 'MainThread': missing ScriptRunContext! This warning can be ignored when running in bare mode.

In [ ]:
#Q16
# To import module foo and alias it as f we write
# import foo as f

In [ ]:
#Q17
# What command would you use to print the last 5 rows of a pandas object?
# A.	print(data[-5:])

In [ ]:
#Q18

'''
for the file demo.py, the code under:
if __name__=='__main__`:

'''
# A.	will only execute when demo.py is executed as the main program, not when it is imported as a module

In [ ]:
# Q19
#To halt the debugger on a line of code we must set a:

# A.	breakpoint

In [ ]:
# Q20
# When the VS Code debugger stops on a line of code we can observe variables in memory. This is called a
# watch

In [ ]:
# Q21
# A copy of your github repository on your laptop computer is known as a
# clone

In [ ]:
# Q22
# A copy of someone else's github repository into a repository under your github account is known as a:
# fork

In [ ]:
# Q23

teststring = 'Find all of the words in a string that are less than 4 letters'
results= []
for word in teststring.split():
    if len(word) < 4:
        results.append(word)
print(results)

# split the string into a list of word
# iterates over each word
# filter to only words less than 4 letters.
# store in a list called results

['all', 'of', 'the', 'in', 'a', 'are', '4']

In [30]:
teststring = 'Find all of the words in a string that are less than 4 letters'
results = [word for word in teststring.split() if len(word) < 4]
print(results)

['all', 'of', 'the', 'in', 'a', 'are', '4']

### Q24
### Best practice - data lineage

When combining datasets, its a really good idea to retain **data lineage**, or a record of where the data came from. This can be done by added a column to each dataframe before concatenating.

**KPI** summarizes larger points of data, so they can be measured over time. 
- It is used to measure performance
- Support decision making 
- Track progress over time

In summary a quantifiable way to evaluate progress toward achieving key business or project goals